Repository: shelllet/languages
Catalog: Strings/*/Resources3.resw
Source language: en_us
Languages: ja_jp, zh_hans_cn, zh_tw

# WindowVisible.Description
source: This action is used to set the window display or hide.
ja_jp: このアクションは、ウィンドウの表示/非表示を設定します。
zh_hans_cn: 此动作用来设置窗口显示或者隐藏。
zh_tw: 此動作用來設定視窗顯示或者隱藏。

# WindowVisible.Title
source: WindowVisible
ja_jp: ウィンドウ表示
zh_hans_cn: 窗口可视
zh_tw: 視窗可視

# TypeColor.Description
source: Define the color type
ja_jp: カラータイプの定義
zh_hans_cn: 定义 颜色 类型
zh_tw: 定義顏色類型

# TypeColor.Title
source: Color
ja_jp: 色
zh_hans_cn: 颜色
zh_tw: 顏色

# DrawRect.Description
source: Draw the object detection results, usually containing a rectangular box
zh_hans_cn: 在图像上绘制一个矩形框。
zh_tw: 在圖像上繪製一個矩形框。

# DrawRect.Title
source: DrawRect
zh_hans_cn: 绘制矩形
zh_tw: 繪製矩形

# FilterEllipse.Description
source: Filter the elements in the ellipse list by the features of the ellipse or circle.
ja_jp: 楕円または円の特性を使用して、楕円リスト内の要素をフィルタします。
zh_hans_cn: 通过 椭圆 或者 圆 的特征筛选 椭圆 列表中的元素。
zh_tw: 通過橢圓或者圓的特徵篩選橢圓清單中的元素。

# FilterEllipse.Title
source: FilterEllipse
ja_jp: 楕円フィルタリング
zh_hans_cn: 椭圆筛选
zh_tw: 橢圓篩選

# CloseHandle.Description
source: Close the application degree open handle
ja_jp: 適用レベルオンのハンドルをオフにする
zh_hans_cn: 关闭应用程度打开的句柄
zh_tw: 關閉應用程度打開的控制碼

# CloseHandle.Title
source: CloseHandle
ja_jp: ハンドルを閉じる
zh_hans_cn: 关闭句柄
zh_tw: 關閉控制碼

# EnumWindows.Description
source: Enumerate the window in the operating system and sort according to the creation time of the process of the window.
zh_hans_cn: 枚举操作系统中的窗口，并按照窗口所在进程的创建时间进行排序。
zh_tw: 枚舉視窗

# EnumWindows.Title
source: EnumWindows
ja_jp: 列挙ウィンドウ
zh_hans_cn: 枚举窗口
zh_tw: 枚舉操作系統中的窗口，並按照窗口所在進程的創建時間進行排序。

# AdbIsInstalled.Description
source: Check if an android application is installed on a device.
zh_hans_cn: 检测 Android 应用程序包是否已经安装。
zh_tw: 檢測 Android 應用程序包是否已經安裝。

# AdbIsInstalled.Title
source: AdbIsInstalled
zh_hans_cn: 应用检测
zh_tw: 應用檢測

# MatchTemplate.Description
source: Simple picture lookup is usually used to find smaller images, or images with fewer features.
ja_jp: 単純な画像検索。通常、小さい画像や特徴の少ない画像を検索するために使用されます。
zh_hans_cn: 简单的图片查找，通常用于查找较小的图像,或者特征比较少的图像。
zh_tw: 簡單的圖片查找，通常用於查找較小的影像，或者特徵比較少的影像。

# MatchTemplate.Title
source: MatchTemplate
ja_jp: テンプレートマッチング
zh_hans_cn: 模板匹配
zh_tw: 範本匹配

# LogicalOperator.Description
source: Logical operation
ja_jp: ろんりえんざん
zh_hans_cn: 逻辑运算
zh_tw: 邏輯運算

# LogicalOperator.Title
source: LogicalOperator
ja_jp: ろんりえんざん
zh_hans_cn: 逻辑运算
zh_tw: 邏輯運算

# RelationalOperator.Description
source: The relationship operation is used to compare the values of two operations, which returns a boolean value, either true or false based on the value of the operand.
ja_jp: リレーショナル演算は、2つのオペランドの値を比較するために使用されます。リレーショナル演算は、オペランドの値に基づいてtrueまたはfalseを返すブール値を返します。
zh_hans_cn: 关系运算用来比较两个操作数值，关系运算返回一个布尔值，即根据操作数的值返回True或False。
zh_tw: 關係運算用來比較兩個操作數值，關係運算返回一個布林值，即根據操作數的值返回true或false。

# RelationalOperator.Title
source: RelationalOperator
ja_jp: かんけいえんざん
zh_hans_cn: 关系运算
zh_tw: 關係運算

# ImageMarkROI.Description
source: Mark the area of interest, such as when looking for a picture, and only find the image from that area.
ja_jp: 画像を探す際に、画像の関心のある領域を特定し、その領域からのみ画像を検索することができるようにする。
zh_hans_cn: 标记图片感兴趣的区域，比如在找图时，只从该区域查找图片。
zh_tw: 標記圖片感興趣的區域，比如在找圖時，只從該區域查找圖片。

# ImageMarkROI.Title
source: ImageMarkROI
ja_jp: Roiのタグ付け
zh_hans_cn: 标记区域
zh_tw: 標記區域

# TypeString.Description
source: Define a string type
ja_jp: 文字列型の定義
zh_hans_cn: 定义一个 字符串 类型
zh_tw: 定義一個字串類型

# TypeString.Title
source: String
ja_jp: 文字列
zh_hans_cn: 字符串
zh_tw: 字串

# WindowXy.Description
source: Get or set location of the specified window. This position is given by the screen coordinates in the upper left corner of the screen coordinate.
zh_hans_cn: 获取或设置指定窗口的位置，该位置相对于屏幕坐标左上角的屏幕坐标给出。
zh_tw: 获取或设置指定窗口的位置，該位置相對於屏幕坐標左上角的屏幕坐標給出。

# WindowXy.Title
source: WindowXy
zh_hans_cn: 窗口位置
zh_tw: 視窗位置

# IterRow.Description
source: Iterate over DataFrame rows as (index, Series) pairs.
zh_hans_cn: 将 DataFrame 行作为（索引，数组）对进行迭代。
zh_tw: 將 DataFrame 行作為（索引，數組）對進行迭代。

# IterRow.Title
source: IterRow
zh_hans_cn: 迭代行
zh_tw: 迭代行

# WindowSize.Description
source: Get or set the window size (Width and Height)
ja_jp: ウィンドウサイズ（長さと幅）を取得または設定します
zh_hans_cn: 获取或设置窗口的大小（长和宽）
zh_tw: 獲取或設置窗口的大小（長和寬）

# WindowSize.Title
source: WindowSize
ja_jp: ウィンドウサイズ
zh_hans_cn: 窗口大小
zh_tw: 窗口大小

# ExistProcess.Description
source: Check whether the application runs
ja_jp: アプリケーションが実行されるかどうかを確認します
zh_hans_cn: 该动作可以检查系统当中的应用程序是否运行
zh_tw: 該動作可以檢查系統當中的應用程序是否運行

# ExistProcess.Title
source: ExistProcess
zh_hans_cn: 检测进程
zh_tw: 檢測進程

# RandomPoint.Description
source: Generate random point
ja_jp: ランダムポイントを生成します
zh_hans_cn: 生成随机坐标
zh_tw: 生成隨機點

# RandomPoint.Title
source: RandomPoint
ja_jp: ランダム座標
zh_hans_cn: 随机坐标
zh_tw: 隨機點

# WorkBegin.Description
source: Start a working thread
zh_hans_cn: 启动一个工作线程
zh_tw: 啟動一個工作線程

# WorkBegin.Title
source: WorkBegin
zh_hans_cn: 异步启动
zh_tw: 異步啟動

# PixelPoint.Description
source: This Action retrieves the red, green, blue (RGB) color value of the pixel at the specified coordinates.
zh_hans_cn: 这个动作检索指定坐标处的像素的红色，绿色，蓝色（RGB）颜色值。
zh_tw: 這個動作檢索指定坐標處的像素的紅色，綠色，藍色（RGB）顏色值。

# PixelPoint.Title
source: PixelPoint
zh_hans_cn: 屏幕取色
zh_tw: 屏幕取色

# WorkReset.Description
source: This action can be used to switch the status of asynchronous action (stopped/running), such as thread and timer.
zh_hans_cn: 这个动作可用于切换异步动作的状态（停止/运行）,比如线程和定时器。
zh_tw: 這個動作可用於切換異步動作的狀態（停止/運行）,比如線程和定時器。

# WorkReset.Title
source: WorkReset
zh_hans_cn: 状态切换
zh_tw: 狀態切換

# Password.Description
source: Password
zh_hans_cn: 密码验证方式
zh_tw: 密碼驗證方式

# Password.Title
source: Password
zh_hans_cn: 密码
zh_tw: 密碼

# Platform.Description
source: Platform
zh_hans_cn: 平台验证方式
zh_tw: 平台驗證方式

# Platform.Title
source: Platform
zh_hans_cn: 平台
zh_tw: 平台

# ImageMarkRelativeROI.Description
source: According to the relative position of the image, the area where interested is interested
zh_hans_cn: 根据相对位置，标记图片感兴趣的区域，比如在找图时，只从该区域查找图片。
zh_tw: 根據相對位置，標記圖片感興趣的區域，比如在找圖時，只從該區域查找圖片。

# ImageMarkRelativeROI.Title
source: ImageMarkRelativeROI
zh_hans_cn: 标记相对区域
zh_tw: 標記相對區域

# WindowPoint.Description
source: This action can get several window coordinates in the window.For example: in the upper left corner, lower left corner, upper right corner, lower right corner, center.
zh_hans_cn: 这个动作可以获取窗口当中几个特定位置的窗口坐标。比如：左上角， 左下角，右上角，右下角，中心。
zh_tw: 這個動作可以獲取窗口當中幾個特定位置的窗口坐標。比如：左上角， 左下角，右上角，右下角，中心。

# WindowPoint.Title
source: WindowPoint
zh_hans_cn: 窗口坐标
zh_tw: 窗口坐標

# WorkWait.Description
source: Waiting for the end of asynchronous action
zh_hans_cn: 等待异步动作的结束
zh_tw: 等待異步動作的結束

# WorkWait.Title
source: WorkWait
zh_hans_cn: 异步等待
zh_tw: 異步等待

# TypeCamera.Description
source: Camera Device
zh_hans_cn: 相机设备
zh_tw: 相機设备

# TypeCamera.Title
source: Camera
zh_hans_cn: 相机
zh_tw: 相機

# ImageDifference.Description
source: Compare two images, or two contours and returns a metric showing the similarity.
zh_hans_cn: 比较两个图像，或两个轮廓，并返回显示相似性的度量标准。
zh_tw: 比較兩個圖像，或兩個輪廓，並返回顯示相似性的度量標準。

# ImageDifference.Title
source: ImageDifference
zh_hans_cn: 图像比较
zh_tw: 圖像比較

# VideoFrame.Description
source: Get the current image frame of the camera
zh_hans_cn: 获取相机当前图像帧
zh_tw: 獲取相機當前圖像幀

# VideoFrame.Title
source: VideoFrame
zh_hans_cn: 相机图像
zh_tw: 相機圖像

# Custom.Description
source: Custom Plugins
zh_hans_cn: 自定义插件
zh_tw: 自定義插件

# Custom.Title
source: Custom
zh_hans_cn: 自定义
zh_tw: 自定義

# ShapeDetection.Description
source: Find the common shapes on the image, such as: triangle, quadranges, squares.
zh_hans_cn: 查找图像上的基本形状，如：三角形、四边形、正方形。
zh_tw: 查找圖像上的基本形狀，如：三角形、四邊形、正方形。

# ShapeDetection.Title
source: ShapeDetection
zh_hans_cn: 形状查找
zh_tw: 形狀查找

# ScalePixel.Description
source: Substate the pixels in the image and multiply the proportional factor to (zoom) our image channel.
zh_hans_cn: 对图像中的像素进行缩放，将比例因子乘以（缩放）我们的图像通道。
zh_tw: 對圖像中的像素進行縮放，將比例因子乘以（縮放）我們的圖像通道。

# ScalePixel.Title
source: ScalePixel
zh_hans_cn: 像素缩放
zh_tw: 像素縮放

# ImageMean.Description
source: Image Mean
zh_hans_cn: 从通道中减去平均值来标准化我们的像素值。
zh_tw: 從通道中減去平均值來標準化我們的像素值

# ImageMean.Title
source: ImageMean
zh_hans_cn: 均值
zh_tw: 均值

# ImageStd.Description
source: Image standard deviation
zh_hans_cn: 计算图像中每个通道的标准差。
zh_tw: 計算圖像中每個通道的標準差。

# ImageStd.Title
source: ImageStd
zh_hans_cn: 标准差
zh_tw: 標準差

# TypeStrings.Description
source: Define a list of strings
zh_hans_cn: 定义一个字符串列表
zh_tw: 定義一個字符串列表

# TypeStrings.Title
source: Strings
zh_hans_cn: 字符串列表
zh_tw: 字符串列表

# PopBack.Description
source: Removes the last element in the vector, effectively reducing the container size by one.
zh_hans_cn: 删除容器中的最后一个元素，有效地将容器大小减少一个。
zh_tw: 刪除容器中的最後一個元素，有效地將容器大小減少一個。

# PopBack.Title
source: PopBack
zh_hans_cn: 尾部取出
zh_tw: 尾部取出

# PushBack.Description
source: Adds a new element at the end of the vector, after its current last element.
zh_hans_cn: 在容器的末尾添加一个新元素，位于其当前最后一个元素之后。
zh_tw: 在容器的末尾添加一個新元素，位於其當前最後一個元素之後。

# PushBack.Title
source: PushBack
zh_hans_cn: 尾部压入
zh_tw: 尾部壓入

# JoinString.Description
source: Join string with seperator.
zh_hans_cn: 使用分隔符，合并字符串。
zh_tw: 使用分隔符，合併字符串。

# JoinString.Title
source: JoinString
zh_hans_cn: 合并字符串
zh_tw: 合併字符串

# BarcodeCreate.Description
source: Generate barcode image
zh_hans_cn: 生成条形码图片
zh_tw: 生成條形碼圖片

# BarcodeCreate.Title
source: BarcodeCreate
zh_hans_cn: 生成条码
zh_tw: 生成條碼

# DrawText.Description
source: Draw text on the image
zh_hans_cn: 在图像上绘制文本
zh_tw: 在圖像上繪製文本

# DrawText.Title
source: DrawText
zh_hans_cn: 绘制文本
zh_tw: 繪製文本

# DrawImage.Description
source: Draw images on the image
zh_hans_cn: 在图像上绘制图像
zh_tw: 在圖像上繪製圖像

# DrawImage.Title
source: DrawImage
zh_hans_cn: 绘制图像
zh_tw: 繪製圖像

# SubString.Description
source: This action can obtain part string according to a specific method.
zh_hans_cn: 该动作根据特定的方法，可以获取部分字符串。
zh_tw: 該動作根據特定的方法，可以獲取部分字符串。

# SubString.Title
source: SubString
zh_hans_cn: 字符串提取
zh_tw: 字符串提取

# TypeDict.Description
source: Dict are used to store data values in key:value pairs.
zh_hans_cn: 字典 用于将数据值存储在（键/值）对中。
zh_tw: 字典 用於將數據值存儲在（鍵/值）對中。

# TypeDict.Title
source: Dict
zh_hans_cn: 字典
zh_tw: 字典

# TypeTuple.Description
source: Tuple are used to store multiple items in a single variable.
zh_hans_cn: 元组用于将多个项目存储在单个变量中。
zh_tw: 元組用於將多個項目存儲在單個變量中。

# TypeTuple.Title
source: Tuple
zh_hans_cn: 元组
zh_tw: 元組

# StandardPath.Description
source: This action contains functions to query standard locations on the local filesystem, for common tasks such as user-specific directories or system-wide configuration directories.
zh_hans_cn: 此操作包含在本地文件系统上查询标准路径位置的功能，例如特定于用户目录或系统范围的配置目录等常见任务。
zh_tw: 此操作包含在本地文件系統上查詢標準路徑位置的功能，例如特定於用戶目錄或系統範圍的配置目錄等常見任務。

# StandardPath.Title
source: StandardPath
zh_hans_cn: 标准路径
zh_tw: 标准路径

# TypeHostAddress.Description
source: Represents an internet (IP) endpoint/socket address. The address can belong either to the IPv4 or the IPv6 address family and consists of a host address and a port number.
zh_hans_cn: 代表Internet（IP）端点/套接字地址。该地址可以属于IPv4或IPv6地址家族，由主机地址和端口号组成。
zh_tw: 代表Internet（IP）端點/套接字地址。該地址可以屬於IPv4或IPv6地址家族，由主機地址和端口號組成。

# TypeHostAddress.Title
source: Host
zh_hans_cn: 主机地址
zh_tw: 主機地址

# FlashWindow.Description
source: Flashes the specified window. It does not change the active state of the window.
zh_hans_cn: 闪烁指定的窗口，它不会更改窗口的活动状态。
zh_tw: 閃爍指定的窗口，它不會更改窗口的活動狀態。

# FlashWindow.Title
source: FlashWindow
zh_hans_cn: 闪烁窗口
zh_tw: 閃爍窗口

# TypeSlice.Description
source: Type Slice
zh_hans_cn: 切片类型
zh_tw: 切片類型

# TypeSlice.Title
source: TypeSlice
zh_hans_cn: 切片
zh_tw: 切片

# AdbInstall.Description
source: Install an Apk file one the android device.
zh_hans_cn: 安装 APk 到安卓设备中。
zh_tw: 安裝 APk 到安卓設備中。

# AdbInstall.Title
source: AdbInstall
zh_hans_cn: 安装 APK
zh_tw: 安裝 APK

# AdbClearText.Description
source: Clear focused input text
zh_hans_cn: 清除当前输入框的文字，必须安装`Adbkeyboard`。
zh_tw: 清除當前輸入框的文字，必須安裝`Adbkeyboard`。

# AdbClearText.Title
source: AdbClearText
zh_hans_cn: 清除文字
zh_tw: 清除文字

# AdbPull.Description
source: Copy files/dirs from device
zh_hans_cn: 从设备复制文件/目录到本地计算机。
zh_tw: 從設備複製文件/目錄到本地計算機。

# AdbPull.Title
source: AdbPull
zh_hans_cn: 拉取文件
zh_tw: 拉取文件

# AdbLs.Description
source: List Files and Directories
zh_hans_cn: 获取文件或者文件夹列表
zh_tw: 獲取文件或者文件夾列表

# AdbLs.Title
source: AdbLs
zh_hans_cn: 文件目录
zh_tw: 文件列表

# TypeList.Description
source: Type List
zh_hans_cn: 列表类型
zh_tw: 列表類型

# TypeList.Title
source: List
zh_hans_cn: 列表
zh_tw: 列表

# MovePointer.Title
source: Simulate the mouse move
ja_jp: マウスを動かす

# MoveClick.Title
source: Move and Click
ja_jp: 移動してクリック

# DoubleClick.Title
source: Double Click
ja_jp: ダブルクリック

# RightClick.Title
source: Right Click
ja_jp: 右クリック

# DragPointer.Description
source: Simulate the mouse drag operation
ja_jp: マウスのドラッグ操作をシミュレートする

# ListenMouse.Title
source: Listen
ja_jp: マウスのリスニング

# WindowCapture.Description
source: This action is used to take screenshots of the specified window
ja_jp: このアクションは、指定したウィンドウをスクリーンショットします

# WindowCapture.Title
source: Window screenshots
ja_jp: ウィンドウのスクリーンショット

# CropImage.Title
source: Cut the picture
ja_jp: 画像のトリミング

# PlayRecord.Title
source: Play recording
ja_jp: 録画を再生

# ONNXClassification.Description
source: Target classification, a suggested model of onnx trained using the * yolo5 * network. other network models that may need to customize the output through a script.
ja_jp: 目標分類には、*yolo5*ネットワーク訓練のonnxのモデルを用いることを提案した。その他のネットワークモデル。スクリプトを使用して出力をカスタマイズする必要がある場合があります。

# ONNXClassification.Title
source: Target classification
ja_jp: もくてきぶんるい

# Window.Description
source: Window class
ja_jp: ウィンドウクラス

# Window.Title
source: Window class
ja_jp: ウィンドウクラス

# For.Description
source: Cycles, mainly used to iterate over the container
ja_jp: 主にコンテナを反復するために使用されるループ

# For.Title
source: Recurrence
ja_jp: じゅんかん

# Image.Title
source: Image processing
ja_jp: 画像処理

# ImageSave.Title
source: Save the image
ja_jp: 画像を保存

# FeatureDetect.Description
source: This action looks for an image with certain features in an image
ja_jp: このアクションは、1つの画像の中で特定の特徴を持つ画像を検索します

# FeatureDetect.Title
source: Image search
ja_jp: 画像検索

# ExitApp.Title
source: Withdraw from
ja_jp: 退出

# ONNXDetection.Description
source: Target detection, only support onnx models in yolo 5 format, other onnx detection models need to be output through scripts
ja_jp: ターゲット検出、yolo5形式のonnxモデルのみサポート、その他のonnx検出モデルはスクリプトによる自己解析出力が必要

# ONNXDetection.Title
source: Object detection
ja_jp: ターゲット検出

# Detection.Title
source: Image detection
ja_jp: がぞうけんしゅつ

# Dnn.Title
source: Deep learning
ja_jp: ディープラーニング

# Drawing.Description
source: Plot
ja_jp: 図形描画

# Drawing.Title
source: Plot
ja_jp: 図形描画

# MatchShapes.Title
source: Shape matching
ja_jp: シェイプマッチング(shape matching)

# ReadJson.Description
source: Fetch json
ja_jp: Jsonの読み取り

# ReadJson.Title
source: Fetch json
ja_jp: Jsonの読み取り

# RandomNumber.Title
source: Random number
ja_jp: 乱数

# AccessSize.Description
source: Get the length of the array.
ja_jp: 配列の長さを取得します。

# AccessSize.Title
source: Array length
ja_jp: 配列長

# Web.Description
source: Browser operation
ja_jp: ブラウザのアクション

# Web.Title
source: Web
ja_jp: ウェブ

# WebOpen.Title
source: Open the browser
ja_jp: ブラウザを開く

# HttpDownload.Title
source: Download
ja_jp: ダウンロード

# SendKeyMessage.Description
source: Send a keyboard message to the window
ja_jp: ウィンドウにキーボードメッセージを送信

# SendKeyMessage.Title
source: Send keyboard messages
ja_jp: キーボード・メッセージの送信

# LaunchFile.Description
source: This action opens a file associated in the operating system.
ja_jp: このアクションは、オペレーティングシステムで関連付けられているファイルタイプのファイルを開きます。

# LaunchFile.Title
source: Open-file
ja_jp: ファイルを開く

# WebSwitchToFrame.Title
source: Switch frame
ja_jp: フレームの切り替え

# WebFocusFrameDefault.Description
source: Switch the focus to the default frame.
ja_jp: フォーカスを標準フレームに切り替えます。

# WebFocusFrameDefault.Title
source: Frame * sets the focus
ja_jp: フレーム*フォーカスの設定

# WebActionChainsCreated.Description
source: Create the web, and the action chain
ja_jp: Webアクションチェーンの作成

# WebActionChainsCreated.Title
source: Action chain * created
ja_jp: アクションチェーン*作成

# When.Description
source: The action opens a thread-constant detection condition until the condition is established, and when the condition holds, the sub-process is executed.
ja_jp: このアクションは、条件が成立するまでスレッドのチェック条件をオンにし、条件が成立すると、サブフローを実行する。

# When.Title
source: When... established
ja_jp: 成立したとき

# ShowMessageBox.Description
source: A prompt box is displayed
ja_jp: プロンプトボックスを表示

# ShowMessageBox.Title
source: Tooltip
ja_jp: プロンプトボックス

# MoveOffset.Title
source: Offset movement
ja_jp: オフセット移動

# CenterCropImage.Title
source: Cut the picture
ja_jp: 画像のトリミング

# WinRun.Title
source: Run dialog
ja_jp: 「実行」ダイアログ

# HttpGet.Description
source: Send a get request based on http
ja_jp: Httpベースのget要求の送信

# HttpGet.Title
source: Get
ja_jp: ゲット

# ONNXModel.Description
source: Load the onnx, the model file
ja_jp: Onnxモデルファイルをロードする

# ONNXModel.Title
source: Model
ja_jp: モデル

# BlobDetect.Title
source: Blob seek
ja_jp: ブロブ検索

# SendMouseClick.Description
source: Send a mouse message
ja_jp: マウスメッセージの送信

# SendMouseClick.Title
source: Send a mouse message
ja_jp: マウスメッセージの送信

# YoutubeDownload.Description
source: Currently, only youtube video download is supported, requiring access to the youtube network.
ja_jp: 現在はユーチューブ動画のダウンロードのみに対応しており、ユーチューブにアクセスできるネットワークが必要となる。

# YoutubeDownload.Title
source: Video download
ja_jp: ビデオのダウンロード

# DirectoryIterator.Description
source: Evolve the folder
ja_jp: フォルダを移動

# DirectoryIterator.Title
source: Evolve the folder
ja_jp: フォルダを移動

# CopyFile.Description
source: Copy file
ja_jp: ファイルのコピー

# CopyFile.Title
source: Copy file
ja_jp: ファイルのコピー

# WindowTitle.Description
source: Get, or set, the window header
ja_jp: ウィンドウタイトルの取得または設定

# WindowTitle.Title
source: Window title
ja_jp: ウィンドウのタイトル

# FastLineDetection.Description
source: Find lines using a fast line detection algorithm
ja_jp: 高速線分検出アルゴリズムを使用した線分の検索

# FastLineDetection.Title
source: Quick straight line check
ja_jp: 高速直線検査

# EdgeLineDetection.Description
source: Find line segments by edge detection
ja_jp: エッジ検出による線分の検索

# EdgeLineDetection.Title
source: Line segment detection
ja_jp: 線分検出

# ImageInRange.Description
source: Specify a color range, capture the color in the image within the color range, through this way, you can screen out the specific color objects in the image.
ja_jp: 色の範囲を指定し、映像中の色の範囲内にある色を抽出することにより、映像中の特定の色のオブジェクトを絞り込むことができる。

# ImageBlur.Title
source: Vague
ja_jp: ぼやける

# ApproxPolyDP.Description
source: The process of approximating the shape of one contour to another shape consisting of a smaller number of vertices so that the distance between the contour of the shape is equal to or less than the specified precision is called the approximate contour of the shape
ja_jp: 形状の輪郭間の距離が所定の精度以下になるように、ある輪郭の形状を他の頂点の数が少ない形状に近似することを、形状の近似輪郭と呼ぶ

# ApproxPolyDP.Title
source: Approximate outline
ja_jp: 近似輪郭

# FindNonZero.Title
source: Non-zero pixel point
ja_jp: ゼロ以外のピクセル点

# SetForegroundWindow.Description
source: Set the front window
ja_jp: 前面ウィンドウの設定

# SetForegroundWindow.Title
source: Front window
ja_jp: 前面ウィンドウ

# ShutdownSystem.Description
source: This action can turn off the operating system, where the computer is turned off.
ja_jp: この動作でosをシャットダウン、つまりパソコンをシャットダウンすることができます。

# ShutdownSystem.Title
source: Shut down
ja_jp: シャットダウン

# TimedTask.Description
source: The action is triggered at a specified time, and the corresponding subaction may be performed.
ja_jp: アクションは、指定された時間にトリガされ、対応するサブアクションを実行することができる。

# TimedTask.Title
source: Timed task
ja_jp: ていじタスク

# HttpPost.Title
source: Post
ja_jp: ポスト

# HttpHead.Description
source: Send the head requests based on the http
ja_jp: Httpベースのhead要求の送信

# HttpHead.Title
source: Head
ja_jp: ヘド

# AdbKillServer.Description
source: Terminate the android simulator service and end the process adb.exe.
ja_jp: Androidエミュレータサービスを終了し、プロセスadb.exeを終了します。

# AdbKillServer.Title
source: Termination of service
ja_jp: サービスの終了

# AdbDevices.Title
source: List of equipment
ja_jp: ユニット・リスト

# AdbStartServer.Description
source: Start the adb service
ja_jp: Adbサービスの開始

# AdbStartServer.Title
source: Start the service
ja_jp: サービスの開始

# AdbForward.Title
source: Retransmission
ja_jp: 転送

# AdbConnect.Title
source: Linkage
ja_jp: 接続

# AdbIfConfig.Description
source: View the simulator network configuration
ja_jp: エミュレータのnic構成の表示

# AdbIfConfig.Title
source: Network card configuration
ja_jp: Nic構成

# AdbRemoveForward.Description
source: Remove the port forwarding in the current system.
ja_jp: 現在のシステムからポート転送を削除します。

# AdbRemoveForward.Title
source: Remove forwarding
ja_jp: 転送の削除

# ReadLines.Description
source: Read multiple lines of files
ja_jp: 複数行ファイルの読み込み

# ReadLines.Title
source: Read multiple lines of files
ja_jp: 複数行ファイルの読み込み

# AdbSwipe.Title
source: Slither
ja_jp: すべり

# AdbInput.Description
source: Simulate input text in the android simulator, this action does not support chinese input.
ja_jp: Androidエミュレータでテキスト入力をシミュレートしますが、この動作は中国語入力には対応していません。

# AdbInput.Title
source: Import
ja_jp: 入力

# BaiduTranslate.Description
source: Baidu translate
ja_jp: 百度翻訳

# BaiduTranslate.Title
source: Baidu translate
ja_jp: 百度翻訳

# AccessKey.Title
source: Access object
ja_jp: オブジェクトへのアクセス

# CaptureForground.Description
source: Front-end window screenshot.
ja_jp: フロントウィンドウのスクリーンショット。

# CaptureForground.Title
source: Screenshot of front window
ja_jp: 前面ウィンドウのスクリーンショット

# XmlLoadDocument.Description
source: Load the xml document
ja_jp: Xmlドキュメントのロード

# XmlLoadDocument.Title
source: D
ja_jp: ドキュメント

# Json.Description
source: Json
ja_jp: ジェイソン

# Json.Title
source: Json
ja_jp: ジェイソン

# XmlGetNodeList.Description
source: Get the xml node
ja_jp: Xmlノードの取得

# XmlGetNodeList.Title
source: Get the node
ja_jp: ノードの取得

# XmlNodeName.Description
source: The xml node name
ja_jp: Xmlノード名

# XmlNodeName.Title
source: Node name
ja_jp: ノード名

# XmlDocumentElement.Description
source: Xml element
ja_jp: Xml要素

# XmlDocumentElement.Title
source: Element
ja_jp: 要素

# XmlReplaceText.Description
source: Replace the node text
ja_jp: ノードテキストの置き換え(replace node text)

# XmlReplaceText.Title
source: Textual substitution
ja_jp: テキスト置換

# XmlSaveDocument.Description
source: Save the xml file
ja_jp: Xmlファイルを保存

# XmlSaveDocument.Title
source: Save
ja_jp: 保存

# IterParam.Description
source: Usually as a child-action, its value is introduced from the corresponding parent actions.Usually, multiple values are returned by the action support children actions, and each element of the list will be passed on to the action.
ja_jp: 通常、サブアクションとして、その値は対応する親アクションから導入されます。通常、複数の値がサブアクションに返され、リストの各要素がアクションに渡されます。

# IterParam.Title
source: IterParam
ja_jp: 入力パラメータ

# WebActionChainsPerform.Description
source: Perform the created action chain.
ja_jp: 作成したアクションチェーンを実行します。

# WebActionChainsPerform.Title
source: Action chain * execution
ja_jp: アクションチェーン*実行

# WebElementIsSelect.Description
source: Return element is selected and can be used to check whether the check box or radio buttons are selected.
ja_jp: 要素が選択されているかどうかを返します。チェックボックスまたはラジオボタンが選択されているかどうかを確認できます。

# WebElementIsSelect.Title
source: Check
ja_jp: チェックを選択

# WebActionMoveOffset.Title
source: Action chain. move (offset)
ja_jp: アクションチェーン：移動(オフセット)いどうチェーン

# LoggingEnabled.Description
source: This action is used to control the output logs in the process
ja_jp: このアクションは、プロセスの出力ログを制御するために使用されます

# LoggingEnabled.Title
source: Outgoing control
ja_jp: しゅつりょくせいぎょ

# AdaptiveThreshold.Title
source: Adaptive threshold
ja_jp: てきおうしきい値

# TcpListen.Description
source: This action is used to create a tcp or a udp server.
ja_jp: このアクションは、tcpまたはudpサービス側を作成するために使用されます。

# TcpListen.Title
source: Monitor
ja_jp: 傍受

# TcpSend.Description
source: This action sends data through either tcp or udp.
ja_jp: この動作は、tcpまたはudpを介してデータを送信する。

# TcpSend.Title
source: Transmit by radio
ja_jp: 送信

# TcpReceive.Description
source: This action receives the data through either the tcp or the udp.
ja_jp: この動作は、tcpまたはudpを介してデータを受信する。

# TcpReceive.Title
source: Receive
ja_jp: じゅしん
